{
  "common": {
    "phoneNum": "٦٤۲۳ ۷۱۱ ٥۰ ۹٦٦+",
    "header": {
      "home": "الرئيسية",
      "services": "خدماتنا",
      "projects": "المشاريع",
      "contact": "اتصل بنا"
    },
    "footer": {
      "companyDescription": "الشركة الرائدة في مجال المقاولات الكهربائية والميكانيكية في المملكة العربية السعودية منذ البداية.",
      "copyWrite": "اللؤلؤة السوداء SA. ",
      "services": {
        "title": "خدمات"
      },
      "contact": {
        "title": "اتصال"
      },
      "projects": {
        "title": "المشاريع",
        "field": {
          "label": "أدخل عنوان بريدك الإلكتروني",
          "placeholder": "البريد الإلكتروني الخاص بك للحصول على التحديثات",
          "btn": "يُقدِّم"
        }
      }
    },
    "servicesList": {
      "hvac": {
        "title": "حلول التدفئة والتهوية وتكييف الهواء",
        "description": "بدءًا من التصميم ووصولاً إلى التركيب والصيانة، توفر حلول التدفئة والتهوية وتكييف الهواء (HVAC) لدينا تحكمًا موثوقًا في المناخ مصممًا خصيصًا ليناسب متطلبات كل مشروع."
      },
      "electrical": {
        "title": "الخدمات الكهربائية",
        "description": "تغطي خدماتنا الكهربائية مجموعة واسعة من الاحتياجات، بدءًا من الإعداد الأولي وحتى الصيانة المستمرة، مع التركيز على السلامة والكفاءة."
      },
      "fireSafety": {
        "title": "حلول السلامة من الحرائق",
        "description": "نحن نقدم أنظمة متقدمة للحماية من الحرائق، مصممة لحماية الأصول وضمان الامتثال لمعايير السلامة."
      },
      "plumbing": {
        "title": "حلول السباكة",
        "description": "خدمات سباكة شاملة لمختلف التطبيقات، مما يضمن تركيب أنظمة المياه وصيانتها وفقًا لأعلى المعايير."
      },
      "surveillance": {
        "title": "المراقبة والأمن",
        "description": "تشمل حلولنا المتخصصة في مجال السلامة والأمن أنظمة المراقبة والتحكم في الوصول والاستعداد لحالات الطوارئ، مما يعزز حماية الأشخاص والممتلكات."
      },
      "maintenance": {
        "title": "عقود الصيانة",
        "description": "نحن نقدم خدمات صيانة كاملة في جميع تخصصات الهندسة الكهربائية والميكانيكية، مما يضمن التشغيل السلس وطول عمر الأنظمة الأساسية."
      }
    },
    "contactForm": {
      "formFields": {
        "firstName": "الاسم الأول",
        "lastName": "اسم العائلة",
        "email": "بريد إلكتروني",
        "message": "رسالة"
      },
      "btn": "يُقدِّم",
      "alerts": {
        "error": "يرجى ملء جميع الحقول قبل الإرسال",
        "success": "تم إرسال النموذج بنجاح!"
      }
    },
    "contactTypes": {
      "phone": "هاتف",
      "email": "بريد إلكتروني"
    },
    "pageHeading": {
      "title": "التميز في حلول الهندسة الكهربائية والميكانيكية",
      "description": "تقديم خدمات التدفئة والتهوية وتكييف الهواء ومكافحة الحرائق والكهرباء والسباكة من الدرجة الأولى في جميع أنحاء المملكة العربية السعودية."
    },
    "errors": {
      "required": "{{label}} مطلوب(*)",
      "invalidEmail": "البريد الإلكتروني غير صالح"
    }
  },
  "pages": {
    "home": {
      "imageBanner": {
        "title": "المقاول الرائد في مجال الأنظمة الكهروميكانيكية بالمملكة العربية السعودية",
        "description": ".تقديم خدمات عالية الجودة في أنظمة HVAC، مكافحة الحرائق، الأعمال الكهربائية، والسباكة",
        "btn": "ابدأ"
      },
      "aboutSection": {
        "list": {
          "about": {
            "title": "من نحن",
            "description": ".بصفتنا مقاول MEP رائدًا في المملكة العربية السعودية، نتميز بتقديم خدمات استثنائية في أنظمة HVAC، مكافحة الحرائق، الأعمال الكهربائية، والسباكة. مع سجل حافل يضم أكثر من 500 مشروع ناجح، فإن التزامنا بالجودة والابتكار يجعلنا في مقدمة هذا المجال. فريقنا من المحترفين ذوي الخبرة ملتزم بتقديم حلول مخصصة تلبي الاحتياجات الفريدة لكل مشروع، مع ضمان السلامة والكفاءة والاستدامة.نفتخر بقدرتنا على إدارة التركيبات المعقدة مع الالتزام بالجدول الزمني والميزانية المحددة. من خلال الاستفادة من أحدث التقنيات وأفضل الممارسات، نسعى لتجاوز توقعات العملاء والمساهمة في نمو البنية التحتية في المنطقة. محور عملياتنا هو السعي المستمر لتحقيق التميز، مما يجعلنا الخيار المفضل في مجال مقاولات MEP في المملكة العربية السعودية"
          },
          "commitment": {
            "title": "التزامنا بالجودة",
            "description": ".نفتخر بفريقنا المميز في مجال MEP، الذي يُشكل العنصر الأساسي الذي يميزنا في هذا القطاع. التزامنا بتقديم نتائج مميزة لا يتزعزع، حيث نُولي أولوية قصوى لفهم احتياجات عملائنا بدقة. من خلال بناء علاقات قوية والحفاظ على قنوات تواصل مفتوحة، نضمن أن تتماشى جميع المشاريع مع توقعات عملائنا. يعمل فريقنا المتفاني بلا كلل لتنفيذ حلول مبتكرة لا تفي فقط بالنتائج المرجوة، بل تتجاوزها. نحن نؤمن بأن ترك بصمة إيجابية في كل مشروع يُساهم في نجاح عملائنا والمجتمع بشكل أوسع. ومع تركيزنا على الجودة والموثوقية، نحن عازمون على الاستمرار كرواد في مجالنا، مدفوعين بشغفنا للتميز ورضا العملاء"
          }
        }
      },
      "servicesSection": {
        "title": "خدماتنا",
        "description": "خبراء الحلول الكهروميكانيكية في المملكة العربية السعودية، مما يضمن الجودة والكفاءة في كل مشروع."
      },
      "projectsSection": {
        "title": "قسم المشاريع",
        "description": "قدم ملخصًا قصيرًا لمشاريعك الأخيرة، مع تسليط الضوء على أهم الأشياء.",
        "list": {
          "first": {
            "title": "المصنع، المنطقة الصناعية الرابعة، جدة",
            "description": "لقد قدمنا ​​حلاً كاملاً للكابلات الداخلية للمنشأة، مما يضمن الاتصال السلس والكفاءة التشغيلية."
          },
          "second": {
            "title": "ميرسك، مينا",
            "description": "لقد أكملنا تركيب قنوات التدفئة والتهوية وتكييف الهواء (HVAC) عالية الجودة، مع الالتزام بمعايير SMACNA لضمان الأداء الأمثل والامتثال."
          },
          "third": {
            "title": "مركز وزارة الداخلية الرياضي، ذهبان",
            "description": "تم عرض خبرتنا في مشروع MEP الذي يركز على أنظمة التدفئة والتهوية وتكييف الهواء (HVAC) ومكافحة الحرائق."
          },
          "fourth": {
            "title": "شركة ترتد",
            "description": "لقد قدمنا ​​خدمات التدفئة والتهوية وتكييف الهواء (HVAC) الشاملة، مما يضمن بيئة مريحة وخاضعة للرقابة."
          }
        }
      },
      "reviewsSection": {
        "title": "ماذا يقول عملاؤنا عن شركتنا.",
        "list": {
          "first": {
            "review": "أعجب بالكفاءة والاحتراف. ",
            "reviewer": "عبدالله بن محمد ال سعود"
          },
          "second": {
            "review": "قمنا بتعيينهم لأعمال الكهرباء والسباكة أثناء تجديد مكتبنا. ",
            "reviewer": "ريم بنت عبدالرحمن الغامدي"
          },
          "third": {
            "review": "فريق محترف للغاية! ",
            "reviewer": "حنان بنت خالد العتيب"
          },
          "fourth": {
            "review": "تجربة رائعة في العمل مع هذه الشركة. ",
            "reviewer": "منصور بن سعد الزهراني"
          }
        }
      },
      "contactDetail": {
        "title": "تواصل معنا",
        "description": "شارك مع الزائرين كيف يمكنهم الاتصال بك وشجعهم على طرح أي أسئلة قد تكون لديهم."
      }
    },
    "services": {
      "title": "خدماتنا الحصرية",
      "listBtn": "شاهد المزيد",
      "partners": {
        "title": "شركاؤنا",
        "description": "تمكين التقدم من خلال الشراكات الإستراتيجية مع قادة الصناعة."
      }
    },
    "projects": {
      "title": "مشاريعنا",
      "description": "عرض أكثر من 500 مشروع ناجح في مجال الهندسة الكهربائية والميكانيكية في جميع أنحاء المملكة العربية السعودية.",
      "list": {
        "hvac": {
          "title": "حلول التدفئة والتهوية وتكييف الهواء",
          "description": "تركيب وصيانة الخبراء لتحقيق الأداء الأمثل.",
          "btn": "يتعلم"
        },
        "fireFighting": {
          "title": "مكافحة الحرائق",
          "description": "أنظمة شاملة تضمن معايير السلامة والامتثال.",
          "btn": "يستكشف"
        }
      }
    },
    "contactUs": {
      "heading": {
        "title": "اتصل بنا اليوم",
        "description": "يمكنك الوصول إلى حلول MEP عالية المستوى والمصممة خصيصًا لتلبية احتياجات عملك ومتطلبات مشروعك."
      },
      "details": {
        "title": "اتصل بنا اليوم",
        "description": "تواصل معنا للحصول على أفضل حلول الهندسة الكهربائية والميكانيكية (MEP). ",
        "types": {
          "support": "يدعم",
          "inquiry": "سؤال"
        },
        "btn": "أرسل استفسارك"
      },
      "location": {
        "title": "موقعنا",
        "description": "قم بزيارتنا لاستكشاف حلول الهندسة الكهربائية والميكانيكية عالية المستوى ومحفظتنا الواسعة. ",
        "support": "يدعم",
        "office": "مكتب"
      }
    }
  }
}
